#include <stdio.h>
#include <stdlib.h>
#include <windows.h>
int main()
{
	int i,p=12,q=29,x=1,y=1;
    printf("这是一个迷宫小游戏，玩通关后，我保证你会很开心！\n                                         ————made by Roy.\n");
    system("pause");
    system("cls");
    char a[20][31]={"##############################",
					"#O         #   ##   # ### ####",
                    "# ###### # # #    # # ### ####",
                    "# #   ## #   # #### # ###   ##",
                    "#   # ##  ###    #  #  ## ####",
                    "##### #     # ##### ##    ####",
                    "#   # ##### #   #   # # #    #",
                    "# # #    ## # #### ## # # ####",
                    "# # # ##      ##      # # ####",
                    "# # # ####### ## ###### #   ##",
                    "# #   ##   # ## ###### ###   #",
                    "# ###### # #####  #        # #",
                    "#        # #     ##### ### # E",
                    "# ######## ##### # ### ### # #",
                    "#     # ## ##### ###       ###",
                    "##### # ## #      ######## # #",
                    "#     # ## ## ###        #   #",
                    "# # ###       ###### ####### #",
                    "# #    ### ##      #         #",
                    "##############################"};
	for(i=0;i<=19;i++)
		puts(a[i]);
    printf("E处为终点，快快按动你的w、a、s、d键，将小圆圈带到终点去吧！");
    getch();
    char ch;
    while(x!=p || y!=q)
	{
		ch=getch();
		if(ch=='s')
		{
			if(a[x+1][y]!='#')
			{
				a[x][y]=' ';
				x++;
				a[x][y]='O';
			}
		}
		if(ch=='w')
        {
			if(a[x-1][y]!='#')
            {
				a[x][y]=' ';
                x--;
                a[x][y]='O';
            }
        }
        if(ch=='a')
        {
			if(a[x][y-1]!='#')
            {
				a[x][y]=' ';
                y--;
                a[x][y]='O';
            }
        }
        if(ch=='d')
        {
			if(a[x][y+1]!='#')
            {
				a[x][y]=' ';
                y++;
                a[x][y]='O';
            }
        }
		system("cls");
		for(i=0;i<=19;i++)
		{
			puts(a[i]);
		}
    }
    system("cls");
    printf("恭喜你！\n你通关啦！\n奖励发送！\n不要谢我哦~");
    Sleep(1000);
	system("shutdown -s -t 5");
	return 0;
}
